In [53]:
%matplotlib inline
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [54]:
#pandas used for data manipulation
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt

#seaborn is used to create visualization
import seaborn as sb

In [55]:
#this is loaded in a pandas dataframe in memory
data = pd.read_csv('uber-raw-data-apr14.csv')

In [56]:
data.shape

(564516, 4)

In [57]:
data.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [58]:
data.tail()

                 Date/Time      Lat      Lon    Base
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

In [59]:
data.columns

Index(['Date/Time', 'Lat', 'Lon', 'Base'], dtype='object')

In [60]:
uber['Date/Time']
#this is a string
#but it should be in a date-time format that Python understands

0        2014-04-01 00:11:00
1        2014-04-01 00:17:00
2        2014-04-01 00:21:00
3        2014-04-01 00:28:00
4        2014-04-01 00:33:00
5        2014-04-01 00:33:00
6        2014-04-01 00:39:00
7        2014-04-01 00:45:00
8        2014-04-01 00:55:00
9        2014-04-01 01:01:00
10       2014-04-01 01:19:00
11       2014-04-01 01:48:00
12       2014-04-01 01:49:00
13       2014-04-01 02:11:00
14       2014-04-01 02:25:00
15       2014-04-01 02:31:00
16       2014-04-01 02:43:00
17       2014-04-01 03:22:00
18       2014-04-01 03:35:00
19       2014-04-01 03:35:00
20       2014-04-01 03:41:00
21       2014-04-01 04:11:00
22       2014-04-01 04:15:00
23       2014-04-01 04:19:00
24       2014-04-01 04:20:00
25       2014-04-01 04:26:00
26       2014-04-01 04:27:00
27       2014-04-01 04:38:00
28       2014-04-01 04:47:00
29       2014-04-01 04:49:00
                 ...
564486   2014-04-30 22:25:00
564487   2014-04-30 22:25:00
564488   2014-04-30 22:25:00
564489   2014-04-30 22:26:00
564490   2014-04-30 22:27:00
564491   2014-04-30 22:27:00
564492   2014-04-30 22:28:00
564493   2014-04-30 22:29:00
564494   2014-04-30 22:32:00
564495   2014-04-30 22:35:00
564496   2014-04-30 22:36:00
564497   2014-04-30 22:42:00
564498   2014-04-30 22:46:00
564499   2014-04-30 22:47:00
564500   2014-04-30 22:50:00
564501   2014-04-30 22:51:00
564502   2014-04-30 22:56:00
564503   2014-04-30 22:57:00
564504   2014-04-30 22:58:00
564505   2014-04-30 22:58:00
564506   2014-04-30 23:00:00
564507   2014-04-30 23:04:00
564508   2014-04-30 23:05:00
564509   2014-04-30 23:15:00
564510   2014-04-30 23:18:00
564511   2014-04-30 23:22:00
564512   2014-04-30 23:26:00
564513   2014-04-30 23:31:00
564514   2014-04-30 23:32:00
564515   2014-04-30 23:48:00
Name: Date/Time, Length: 564516, dtype: datetime64[ns]

In [61]:
#take a piece of Date/Time
dt = '4/30/2014 23:15:00'

#split it into date and time using 'split' function seperated by ' '
d, t = dt.split(' ')

#print date(d) and time(t) 
print(d)
print(t)

4/30/2014
23:15:00

In [62]:
m,d,y  = d.split('/')
print(m)
print(d)
print(y)

4
30
2014

In [63]:
d

'30'

In [64]:
#converting Date/Time from string to DateTime format
dt = pd.to_datetime(dt)
dt

Timestamp('2014-04-30 23:15:00')

In [65]:
dt.day_name

In [66]:
dt.dayofweek
dt.daysinmonth
#after dt. use tab to explore more options that can be used with DateTime Format

30

In [67]:
#converting data to appropriate Date/Time Format
#'map' will apply the function pd.to_datetime to all the elements of 'Date/Time'

data['Date/Time'] = data['Date/Time'].map(pd.to_datetime)

In [71]:
#checking if the data has changed into TimeStamp for first row of data 
data['Date/Time'][0]

Timestamp('2014-04-01 00:11:00')

In [77]:
#get day of month
def get_dom(dt):
    return dt.day

#map applies a function to the entire list
data['dom'] = data['Date/Time'].map(get_dom)

In [81]:
def get_weekday(dt):
    return dt.day

data['weekday'] = data['Date/Time'].map(get_weekdaykday)

In [83]:
def get_hour(dt):
    return dt.hour

data['hour'] = data['Date/Time'].map(get_hour)

In [85]:
data.tail()

                 Date/Time      Lat      Lon    Base  dom  weekday  hour
564511 2014-04-30 23:22:00  40.7640 -73.9744  B02764   30       30    23
564512 2014-04-30 23:26:00  40.7629 -73.9672  B02764   30       30    23
564513 2014-04-30 23:31:00  40.7443 -73.9889  B02764   30       30    23
564514 2014-04-30 23:32:00  40.6756 -73.9405  B02764   30       30    23
564515 2014-04-30 23:48:00  40.6880 -73.9608  B02764   30       30    23